declare interface Window {
  datas: Array<any>
}

window.datas = [
  [{
    type: '每天可完成一次',
    name: '春日前奏',
    date: '3月16日-3月23日',
    desc: '春光灿烂，快乐又元气满满不管走到哪里都是好运气。',
    level: '8级',
    condition: '登录游戏,即可完成任务',
    prize: 'p00'
  }, {
    type: '每天可完成一次',
    name: '春光盈盈',
    date: '3月16日-3月23日',
    desc: '春日无限好风光，世界boss和你在这个春天有个约会哦~',
    level: '8级',
    condition: '参与世界boss一次,即可完成任务',
    prize: 'p01'
  }, {
    type: '每天可完成一次',
    name: '碧水流云',
    date: '3月16日-3月23日',
    desc: '蓝天碧水清风拂面，带上小伙伴一起在弹弹王国恣意pk吧！',
    level: '8级',
    condition: '完成3v3自由战8场，即可获得奖励',
    prize: 'p02'
  }, {
    type: '每天可完成一次',
    name: '草长莺飞',
    date: '3月16日-3月23日',
    desc: '春日是播种的季节，快来为你的农场添一抹绿或一霎红吧！要手动种植喏~',
    level: '8级',
    condition: '种植8颗种子,即可完成任务',
    prize: 'p03'
  }],
  [{
    type: '每天可完成一次',
    name: '春花烂漫',
    date: '3月24日-3月31日',
    desc: '春花烂漫行动！小主们！想要奖励吗？不要偷懒哦！快来收集物品，领取属于你的春日特礼！',
    level: '20级',
    condition: '活动期间，集齐许愿瓶x1、同心坠x1、爱心结x1即可完成任务',
    prize: 'p10'
  }, {
    type: '每天可完成一次',
    name: '花满枝桠',
    date: '3月24日-3月31日',
    desc: '花开满枝桠，穿越时空漩涡，遇见那个TA ,约会春天~',
    level: '8级',
    condition: '通关时空漩涡（普通），即可完成任务',
    prize: 'p11'
  }, {
    type: '每天可完成一次',
    name: '幸运星空',
    date: '3月24日-3月31日',
    desc: '带着公会的小伙伴们一起活动活动筋骨吧！',
    level: '8级',
    condition: '公会战获胜6场,即可完成任务',
    prize: 'p12'
  }, {
    type: '每天可完成一次',
    name: '花样年华',
    date: '3月24日-3月31日',
    desc: '弹弹堂勇士试炼来啦！挑战一次英雄级的人鱼boss试试。',
    level: '8级',
    condition: '通关人鱼宝藏（英雄），即可完成任务',
    prize: 'p13'
  }],
  [{
    type: '每天可完成一次',
    name: '解忧春花',
    date: '4月1日-4月8日',
    desc: '解忧大喇叭，把小情绪都用大喇叭痛快喊出来吧！',
    level: '8级',
    condition: '使用大喇叭5次,即可完成任务',
    prize: 'p20'
  }, {
    type: '每天可完成一次',
    name: '雏菊之恋',
    date: '4月1日-4月8日',
    desc: '强大的怪兽也抵挡不了春的诱惑，和它一起玩儿吧！',
    level: '8级',
    condition: '通关天空之城（困难），即可完成任务',
    prize: 'p21'
  }, {
    type: '每天可完成一次',
    name: '萌动爱情',
    date: '4月1日-4月8日',
    desc: '萌弹情缘百变竞技，带着心仪的小伙伴一起随机进入变身状态，变身为游戏内不常见的人物，变身后将获得任务道具”火红晶石x1哦！',
    level: '8级',
    condition: '收集火红晶石x20和商城打折区购买兑换道具大白兔奶糖（8800点券）x1，即可完成任务',
    prize: 'p22'
  }, {
    type: '每天可完成一次',
    name: '追爱之旅',
    date: '4月1日-4月8日',
    desc: '追爱计划， 与TA一起完成竞技任务哦！',
    level: '8级',
    condition: '完成夫妻战5场,即可完成任务',
    prize: 'p23'
  }],
  [{
    type: '活动期间只能完成一次',
    name: '萌动春园',
    date: '3月16日-4月8日',
    desc: '萌弹乐园踏春计划：完成”春之叶“收集任务获取春天的贺礼，谱写春季物语！ ',
    level: '8级',
    condition: '收集春之叶x300,即可完成任务',
    prize: 'p30'
  }]
]